name: yolov9-supernet
hyp: p5
imgsz: 640

# parameters
nc: 80
depth_multiple: 1.0
width_multiple: 1.0
activation: nn.ReLU()

# anchors
anchors: None

# depth list (search space)
depth_list:
  [[1, 2, 3],    # 3  - backbone RepNCSPELAN4
   [1, 2, 3],    # 5
   [1, 2, 3],    # 7
   [1, 2, 3],    # 9
   [1, 2, 3, 4], # 13 - head RepNCSPELAN4
   [1, 2, 3, 4], # 16
   [1, 2, 3, 4], # 19
   [1, 2, 3, 4], # 22
   [1, 2, 3, 4], # 28
   [1, 2, 3, 4], # 31
   [1, 2, 3, 4], # 34
   [1, 2, 3, 4]] # 37

# YOLOv9 backbone
backbone:
  [
   [-1, 1, Silence, []],

   [-1, 1, Conv, [64, 3, 2]],

   [-1, 1, Conv, [128, 3, 2]],

   [-1, 1, RepNCSPELAN4, [256, 128, 64, 4]],

   [-1, 1, Conv, [256, 3, 2]],

   [-1, 1, RepNCSPELAN4, [512, 256, 128, 4]],

   [-1, 1, Conv, [512, 3, 2]],

   [-1, 1, RepNCSPELAN4, [512, 512, 256, 4]],

   [-1, 1, Conv, [512, 3, 2]],

   [-1, 1, RepNCSPELAN4, [512, 512, 256, 4]],
  ]

# YOLOv9 head
head:
  [
   [-1, 1, SPPELAN, [512, 256]],

   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 7], 1, Concat, [1]],

   [-1, 1, RepNCSPELAN4, [512, 512, 256, 4]],

   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 5], 1, Concat, [1]],

   [-1, 1, RepNCSPELAN4, [256, 256, 128, 4]],

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 13], 1, Concat, [1]],

   [-1, 1, RepNCSPELAN4, [512, 512, 256, 4]],

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 10], 1, Concat, [1]],

   [-1, 1, RepNCSPELAN4, [512, 512, 256, 4]],

   [5, 1, CBLinear, [[256]]],
   [7, 1, CBLinear, [[256, 512]]],
   [9, 1, CBLinear, [[256, 512, 512]]],

   [0, 1, Conv, [64, 3, 2]],
   [-1, 1, Conv, [128, 3, 2]],
   [-1, 1, RepNCSPELAN4, [256, 128, 64, 4]],

   [-1, 1, Conv, [256, 3, 2]],
   [[23, 24, 25, -1], 1, CBFuse, [[0, 0, 0]]],

   [-1, 1, RepNCSPELAN4, [512, 256, 128, 4]],

   [-1, 1, Conv, [512, 3, 2]],
   [[24, 25, -1], 1, CBFuse, [[1, 1]]],

   [-1, 1, RepNCSPELAN4, [512, 512, 256, 4]],

   [-1, 1, Conv, [512, 3, 2]],
   [[25, -1], 1, CBFuse, [[2]]],

   [-1, 1, RepNCSPELAN4, [512, 512, 256, 4]],

   [[31, 34, 37, 16, 19, 22], 1, DualDDetect, [nc]],
  ]
