# YOLOv9 supernet (NAS-ready)

name: yolov9-supernet
hyp: p5
imgsz: 640

# parameters
nc: 80                # number of classes
depth_multiple: 1.0   # model depth scale
width_multiple: 1.0   # layer channel multiple

# anchors
anchors: 3


depth_list:
  [[1, 2, 3],       # SLOT[0]:
   [1, 2, 3],       # SLOT[1]:
   [2, 3, 4],       # SLOT[2]:
   [2, 3, 4, 5],    # SLOT[3]: P4
   [2, 3, 4, 5],    # SLOT[4]: P3
   [2, 3, 4, 5],    # SLOT[5]: P4
   [2, 3, 4, 5]]    # SLOT[6]: P5

# yolov9 backbone
backbone:
  [
   # conv down
   [-1, 1, Conv, [16, 3, 2]],                 # 0-P1/2

   # conv down
   [-1, 1, Conv, [32, 3, 2]],                 # 1-P2/4

   # elan-1 block
   [-1, 1, ELAN1, [32, 32, 16]],              # 2

   # avg-conv down
   [-1, 1, AConv, [64]],                      # 3-P3/8

   # elan-2 block (SLOT[0] → max=3)
   [-1, 1, RepNCSPELAN4, [64, 64, 32, 3]],    # 4

   # avg-conv down
   [-1, 1, AConv, [96]],                      # 5-P4/16

   # elan-2 block (SLOT[1] → max=3)
   [-1, 1, RepNCSPELAN4, [96, 96, 48, 3]],    # 6

   # avg-conv down
   [-1, 1, AConv, [128]],                     # 7-P5/32

   # elan-2 block (SLOT[2] → max=4)
   [-1, 1, RepNCSPELAN4, [128, 128, 64, 4]],  # 8
  ]

# yolov9 head
head:
  [
   # elan-spp block
   [-1, 1, SPPELAN, [128, 64]],               # 9

   # up-concat merge
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],                 # 11: cat backbone P4

   # elan-2 block (SLOT[3] → max=5)
   [-1, 1, RepNCSPELAN4, [96, 96, 48, 5]],    # 12

   # up-concat merge
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],                 # 14: cat backbone P3

   # elan-2 block (SLOT[4] → max=5)
   [-1, 1, RepNCSPELAN4, [64, 64, 32, 5]],    # 15  (P3/8-small)

   # avg-conv-down merge
   [-1, 1, AConv, [48]],
   [[-1, 12], 1, Concat, [1]],                # 18: cat head P4

   # elan-2 block (SLOT[5] → max=5)
   [-1, 1, RepNCSPELAN4, [96, 96, 48, 5]],    # 18→19

   # avg-conv-down merge
   [-1, 1, AConv, [64]],
   [[-1, 9], 1, Concat, [1]],                 # cat head P5

   # elan-2 block (SLOT[6] → max=5)
   [-1, 1, RepNCSPELAN4, [128, 128, 64, 5]],  # (P5/32-large)

   # detect
   [[15, 18, 21], 1, DDetect, [nc]],          # DDetect(P3, P4, P5)
  ]