neck:
  [[-1, 1, SPP, [1024, 5]], # 0 [9] connect backbone P5
   [-1, 1, CBS, [512, 1, 1]], # 1 [10] adjust channels -> PA

   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 2 [11] upsize
   [[-1, Backbone], 1, Concat, [1]],  # 3 [12] cat backbone P4
   [-1, 3, CSP, [512, False]],  # 4 [13] (P4/16)
   [-1, 1, CBS, [256, 1, 1]], # 5 [14] adjust channels -> PA

   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 6 [15] upsize
   [[-1, Backbone], 1, Concat, [1]],  # 7 [16] cat backbone P3
   [-1, 3, CSP, [256, False]],  # 8 [17] (P3/8-small) -> head

   [-1, 1, CBS, [256, 3, 2]], # 9 [18] downsize
   [[-1, 5], 1, Concat, [1]],  # 10 [19] cat neck P4
   [-1, 3, CSP, [512, False]],  # 11 [20] (P4/16-medium) -> head

   [-1, 1, CBS, [512, 3, 2]], # 12 [21] downsize
   [[-1, 1], 1, Concat, [1]],  # 13 [22] cat neck P5
   [-1, 3, CSP, [1024, False]],  # 14 [23] (P5/32-large) -> head
  ]

neck-to-head:
  [8, 11, 14] # if backbone is 9-layers, then it will be [17, 20, 23]