backbone:
  [[-1, 1, Focus, [64, 3]],  # 0-P1/2

   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, CSP, [128]],

   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 9, CSP, [256]], # 4 -> neck: cat

   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, CSP, [512]], # 6 -> neck: cat

   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32 -> neck: spp or something else
  ]
