neck:
  [[-1, 1, SPP, [1024, 5]], # connect backbone P5
   [-1, 3, CSP, [1024, False]], # 9 (P5/32)
   [-1, 1, Conv, [512, 1, 1]], # 10 adjust channels -> PA

   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # upsize
   [[-1, Backbone], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, CSP, [512, False]],  # 13 (P4/16)
   [-1, 1, Conv, [256, 1, 1]], # 14 adjust channels -> PA

   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # upsize
   [[-1, Backbone], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, CSP, [256, False]],  # 17 (P3/8-small) -> head: adjust channels

   [-1, 1, Conv, [256, 3, 2]], # downsize
   [[-1, 6], 1, Concat, [1]],  # cat neck P4
   [-1, 3, CSP, [512, False]],  # 20 (P4/16-medium) -> head: adjust channels

   [-1, 1, Conv, [512, 3, 2]], # downsize
   [[-1, 2], 1, Concat, [1]],  # cat neck P5
   [-1, 3, CSP, [1024, False]],  # 23 (P5/32-large) -> head: adjust channels
  ]

neck-to-head:
  [9, 12, 15] # if backbone is composed of 8-layers, then it will be [17, 20, 23]

neck-channel:
  [1024, 512, 256]
