neck:
  [[-1, 1, SPP, [320, 5]],                        # 0 [  ] connect backbone P5

   [[Backbone], 1, Concat, [1]],                  # 1 [  ] added for concat nas 
   [-1, 3, CSP, [320, False]],                    # 2 [  ] (P5/32)
   [-1, 1, CBR6, [96, 1, 1]],                     # 3 [ v ] adjust channels -> PA
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],    # 4 [  ] upsize

   [[-1, Backbone], 1, Concat, [1]],              # 5 [  ] cat backbone P4
   [-1, 3, CSP, [96, False]],                     # 6 [  ] (P4/16)
   [-1, 1, CBR6, [32, 1, 1]],                     # 7 [ v ] adjust channels -> PA
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],    # 8 [  ] upsize

   [[-1, Backbone], 1, Concat, [1]],              # 9 [  ] cat backbone P3

   [-1, 3, CSP, [32, False]],                     # 10 [ v ] (P3/8-small) -> head
   [-1, 1, CBR6, [32, 3, 2]],                     # 11 [  ] downsize

   [[-1, PreLayer], 1, Concat, [1]],              # 12 [  ] cat neck P4
   [-1, 3, CSP, [96, False]],                     # 13 [  ] (P4/16-medium) -> head
   [-1, 1, CBR6, [96, 3, 2]],                     # 14 [  ] downsize

   [[-1, PreLayer], 1, Concat, [1]],              # 15 [  ] cat neck P5
   [-1, 3, CSP, [320, False]],                    # 16 [  ] (P5/32-large) -> head
  ]

fpn-to-pan:
  [3, 7, 10]

neck-to-head:
  [10, 13, 16]

# neck:
#   [[-1, 1, SPP, [320, 5]],                        # 0 [8] connect backbone P5 -> concat <1>

# --------------------------------- add ------------------------------------------------------
#    [5, 1, CBR6, [320, 1, 1]],                     #   [9a] channel+ 
#    [-1, 1, CBR6, [320, 3, 2]],                    #   [10a] downsize -> concat <1>
#    [3, 1, CBR6, [96, 1, 1]],                      #   [11a] channel+
#    [-1, 1, CBR6, [96, 3, 2]],                     #   [12a] downsize -> concat <2>
#    [-1, 1, CBR6, [320, 1, 1]],                    #   [13a] channel+
#    [-1, 1, CBR6, [320, 3, 2]],                    #   [14a] downsize -> concat <1>
# --------------------------------------------------------------------------------------------

#    [[7, 10, -1], 1, Concat, [1]],                 # 1 [15] cat at FPN-P5 <1>
#    [-1, 3, CSP, [320, False]],                    # 2 [16] (P5/32)
#    [-1, 1, CBR6, [160, 1, 1]],                    # 3 [17] channel- -> PA concat <5>
#    [-1, 1, nn.Upsample, [None, 2, 'nearest']],    # 4 [18] upsize -> concat <2>

# --------------------------------- add ------------------------------------------------------
#    [7, 1, CBR6, [96, 1, 1]],                      #   [19a] channel-
#    [-1, 1, nn.Upsample, [None, 2, 'nearest']],    #   [20a] upsize -> concat <2>
# --------------------------------------------------------------------------------------------

#    [[18, 20, 5, 12], 1, Concat, [1]],             # 5 [21] cat at FPN-P4
#    [-1, 3, CSP, [160, False]],                    # 6 [22] (P4/16)
#    [-1, 1, CBR6, [96, 1, 1]],                     # 7 [23] channel- -> PA concat <4>
#    [-1, 1, nn.Upsample, [None, 2, 'nearest']],    # 8 [24] upsize -> concat <3>

# --------------------------------- add ------------------------------------------------------
#    [20, 1, CBR6, [32, 1, 1]],                     #   [25a] channel-
#    [-1, 1, nn.Upsmaple, [None, 2, 'nearest']],    #   [26a] upsample -> concat <3>
#    [5, 1, CBR6, [32, 1, 1]],                      #   [27a] channel-
#    [-1, 1, nn.Upsample, [None, 2, 'nearest']],    #   [28a] upsample -> concat <3>
# --------------------------------------------------------------------------------------------

#    [[24, 26, 28, 4], 1, Concat, [1]],             # 9 [29] cat at FPN-P3

#    [-1, 3, CSP, [32, False]],                     # 10 [30] (P3/8-small) -> head
#    [-1, 1, CBR6, [32, 3, 2]],                     # 11 [31] downsize -> PA concat <4>

# --------------------------------- add ------------------------------------------------------
#    [17, 1, CBR6, [32, 1, 1]],                     #    [32a] channel-
#    [-1, 1, nn.Upsample, [None, 2, 'nearset']]     #    [33a] upsize -> concat <4>
# --------------------------------------------------------------------------------------------

#    [[31, 33, 23], 1, Concat, [1]],                # 12 [34] cat neck P4
#    [-1, 3, CSP, [96, False]],                     # 13 [35] (P4/16-medium) -> head
#    [-1, 1, CBR6, [96, 3, 2]],                     # 14 [36] downsize -> PA concat <5>

# --------------------------------- add ------------------------------------------------------
#    [23, 1, CBR6, [96, 1, 1]],                     #    [37a] channel+
#    [-1, 1, CBR6, [96, 3, 2]],                     #    [38a] downsize -> PA concat <5>
#    [31, 1, CBR6, [96, 1, 1]],                     #    [39a] channel+
#    [-1, 1, CBR6, [96, 3, 2]],                     #    [40a] downsize -> PA concat <5>
# --------------------------------------------------------------------------------------------

#    [[36, 17, 38, 40], 1, Concat, [1]],            # 15 [41] cat neck P5
#    [-1, 3, CSP, [320, False]],                    # 16 [42] (P5/32-large) -> head
#   ]
