neck:
  [[-1, 1, SPP, [1024, 5]],
  # [[[-1, Backbone], 1, ConcatSPP, [1024, [5, 9, 13]]],                     # 0 [8]connect backbone P5
   [[-1, Backbone], 1, ConcatForNas, [1]],                # 1 [9] added for concat nas 
   [-1, 3, CSP, [1024, False]],                 # 2 [10](P5/32)
   [-1, 1, CBS, [512, 1, 1]],                   # 3 [11] adjust channels -> PA

   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 4 [12]upsize
   [[-1, Backbone], 1, ConcatForNas, [1]],            # 5 [13]cat backbone P4
   [-1, 3, CSP, [512, False]],                  # 6 [14] (P4/16)
   [-1, 1, CBS, [256, 1, 1]],                   # 7 [15] adjust channels -> PA

   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 8 [16] upsize
   [[-1, Backbone], 1, ConcatForNas, [1]],            # 9 [17] cat backbone P3
   [-1, 3, CSP, [256, False]],                  # 10[18] (P3/8-small) -> head: adjust channels

   [-1, 1, CBS, [256, 3, 2]],                   # 11[19] downsize -> PA
   [[-1, PreLayer], 1, Concat, [1]],            # 12[20] cat neck P4
   [-1, 3, CSP, [512, False]],                  # 13[21] (P4/16-medium) -> head: adjust channels

   [-1, 1, CBS, [512, 3, 2]],                   # 14[22] downsize
   [[-1, PreLayer], 1, Concat, [1]],            # 15[23] cat neck P5
   [-1, 3, CSP, [1024, False]],                 # 16[24] (P5/32-large) -> head: adjust channels
  ]

fpn-to-pan:
  [3, 7, 11]
  # [10, 6, 2]
  # [2, 6, 10]

neck-to-head:
  [10, 13, 16]                                   # if backbone is composed of 8-layers, then it will be [17, 20, 23]
  # [9, 12, 15]

# neck-channel:
#   [1024, 512, 256]
