backbone:
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2

   [-1, 1, CBS, [128, 3, 2]],  # 1-P2/4
   [-1, 3, CSP, [128]],

   [-1, 1, CBS, [256, 3, 2]],  # 3-P3/8
   [-1, 9, CSP, [256]], # 4 -> neck: cat

   [-1, 1, CBS, [512, 3, 2]],  # 5-P4/16
   [-1, 9, CSP, [512]], # 6 -> neck: cat

   [-1, 1, CBS, [1024, 3, 2]], # 7-P5/32
   [-1, 3, CSP, [1024]], # 8 -> neck: spp or something else
  ]