backbone:
  [[-1, 1, Focus, [64, 3]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, CSP, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 9, CSP, [256]], # 4 -> neck: cat
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, CSP, [512]], # 6 -> neck: cat
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32 -> neck: spp or something else
  ]

neck: 
  [[-1, 1, SPP, [1024, 5]],
   [-1, 3, CSP, [1024, False]],
   [-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, ['None', 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],
   [-1, 3, CSP, [512, False]],
   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, ['None', 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],
   [-1, 3, CSP, [256, False]],
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 14], 1, Concat, [1]],
   [-1, 3, CSP, [512, False]],
   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 10], 1, Concat, [1]],
   [-1, 3, CSP, [1024, False]],
   [[17, 20, 23], 1, Detect, [80, [[10, 13, 16, 30, 33, 23], [30, 61, 62, 45, 59, 119], [116, 90, 156, 198, 373, 326]]]]
  ]

neck-channel: [1024, 512, 256] 