# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [12,16, 19,36, 40,28]  # P3/8
  - [36,75, 76,55, 72,146]  # P4/16
  - [142,110, 192,243, 459,401]  # P5/32

# depth list (search space)
depth_list:
  [[1, 2, 3], # 4-BBoneELAN
   [1, 2, 3], # 11
   [1, 2, 3], # 18
   [1, 2, 3], # 25
   [1, 2, 3, 4, 5], # 32-HeadELAN
   [1, 2, 3, 4, 5], # 38
   [1, 2, 3, 4, 5], # 45
   [1, 2, 3, 4, 5]] # 52

# yolov7 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 3, 1]],  # 0
  
   [-1, 1, Conv, [64, 3, 2]],  # 1-P1/2      
   [-1, 1, Conv, [64, 3, 1]],
   
   [-1, 1, Conv, [128, 3, 2]],  # 3-P2/4  
   [-1, 1, BBoneELAN, [64, 3, 3]], #  args: [c1, k, depth], depth is max value of the depth_list each index
   [-1, 1, DyConv, [256, 1, 1]],  # 5
         
   [-1, 1, MP, []],
   [-1, 1, Conv, [128, 1, 1]],
   [-3, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 10-P3/8  
   [-1, 1, BBoneELAN, [128, 3, 3]], #  args: [c1, k, depth]
   [-1, 1, DyConv, [512, 1, 1]],  # 12
         
   [-1, 1, MP, []],
   [-1, 1, Conv, [256, 1, 1]],
   [-3, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 17-P4/16  
   [-1, 1, BBoneELAN, [256, 3, 3]], #  args: [c1, k, depth]
   [-1, 1, DyConv, [1024, 1, 1]],  # 19
         
   [-1, 1, MP, []],
   [-1, 1, Conv, [512, 1, 1]],
   [-3, 1, Conv, [512, 1, 1]],
   [-1, 1, Conv, [512, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 24-P5/32
   [-1, 1, BBoneELAN, [256, 3, 3]], #  args: [c1, k, depth]
   [-1, 1, DyConv, [1024, 1, 1]],  # 26
  ]

# yolov7 head
head:
  [[-1, 1, SPPCSPC, [512]], # 27
  
   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [19, 1, Conv, [256, 1, 1]], # route backbone P4
   [[-1, -2], 1, Concat, [1]], 
   # 512 c1
   [-1, 1, HeadELAN, [256, 3, 5]], #  args: [c1, k, depth]
   [-1, 1, DyConv, [256, 1, 1]], # 33
   
   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [12, 1, Conv, [128, 1, 1]], # route backbone P3
   [[-1, -2], 1, Concat, [1]],
   
   [-1, 1, HeadELAN, [128, 3, 5]], #  args: [c1, k, depth]
   [-1, 1, DyConv, [128, 1, 1]], # 39
      
   [-1, 1, MP, []],
   [-1, 1, Conv, [128, 1, 1]],
   [-3, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 2]],
   [[-1, -3, 33], 1, Concat, [1]],
   
   [-1, 1, HeadELAN, [256, 3, 5]], #  args: [c1, k, depth]
   [-1, 1, DyConv, [256, 1, 1]], # 46
      
   [-1, 1, MP, []],
   [-1, 1, Conv, [256, 1, 1]],
   [-3, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, -3, 27], 1, Concat, [1]],
   
   [-1, 1, HeadELAN, [512, 3, 5]], #  args: [c1, k, depth]
   [-1, 1, DyConv, [512, 1, 1]], # 53
   
   [39, 1, RepConv, [256, 3, 1]],
   [46, 1, RepConv, [512, 3, 1]],
   [53, 1, RepConv, [1024, 3, 1]],

   [[54,55,56], 1, Detect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]
