# BasicBlock_cifar, [7, 7, 7]
name: resnetc44
hyp: tiny
imgsz: 256
nc: 2 # NORMAL / PNEUMONIA

backbone:
  [[-1, 1, nn.Conv2d, [16, 3, 1, 1, 1, 1, False]], #0
   [-1, 1, nn.BatchNorm2d, [16]],
   [-1, 1, nn.ReLU, [True]],
   [-1, 1, cBasicBlock, [16, 1]], #3 - 1 : layer0
   [-1, 1, cBasicBlock, [16, 1]], #4 - 2 : layer0
   [-1, 1, cBasicBlock, [16, 1]], #5 - 3 : layer0
   [-1, 1, cBasicBlock, [16, 1]], #6 - 4 : layer0
   [-1, 1, cBasicBlock, [16, 1]], #7 - 5 : layer0
   [-1, 1, cBasicBlock, [16, 1]], #8 - 6 : layer0
   [-1, 1, cBasicBlock, [16, 1]], #9 - 7 : layer0
   [-1, 1, cBasicBlock, [32, 2]], #10- 1 : layer1
   [-1, 1, cBasicBlock, [32, 1]], #11- 2 : layer1
   [-1, 1, cBasicBlock, [32, 1]], #12- 3 : layer1
   [-1, 1, cBasicBlock, [32, 1]], #13- 4 : layer1
   [-1, 1, cBasicBlock, [32, 1]], #14- 5 : layer1
   [-1, 1, cBasicBlock, [32, 1]], #15- 6 : layer1
   [-1, 1, cBasicBlock, [32, 1]], #16- 7 : layer1
   [-1, 1, cBasicBlock, [64, 2]], #17- 1 : layer2
   [-1, 1, cBasicBlock, [64, 1]], #18- 2 : layer2
   [-1, 1, cBasicBlock, [64, 1]], #19- 3 : layer2
   [-1, 1, cBasicBlock, [64, 1]], #20- 4 : layer2
   [-1, 1, cBasicBlock, [64, 1]], #21- 5 : layer2
   [-1, 1, cBasicBlock, [64, 1]], #22- 6 : layer2
   [-1, 1, cBasicBlock, [64, 1]], #23- 7 : layer2
  ]

head:
  [[-1, 1, nn.AdaptiveAvgPool2d, [1]],  #24
   [-1, 1, nn.Flatten, []],             #25
   [-1, 1, nn.Linear, [nc, True]],      #26
  ]
