# Bottleneck, [3, 4, 23, 3]
name: resnet101
hyp: tiny
imgsz: 640
nc: 1000

backbone:
  [[-1, 1, nn.Conv2d, [64, 7, 2, 3, False]], #0
   [-1, 1, nn.BatchNorm2d, [64]],
   [-1, 1, nn.ReLU, [True]],
   [-1, 1, nn.MaxPool2d, [3, 2, 1, 1, False, False]],
   [-1, 1, Bottleneck, [64, 1, True,  1, 64, 1, None]], #4 - 1
   [-1, 1, Bottleneck, [64, 1, False, 1, 64, 1, None]], #5 - 2
   [-1, 1, Bottleneck, [64, 1, False, 1, 64, 1, None]], #6 - 3
   [-1, 1, Bottleneck, [128, 2, True,  1, 64, 1, None]], #7  - 1
   [-1, 1, Bottleneck, [128, 1, False, 1, 64, 1, None]], #8  - 2
   [-1, 1, Bottleneck, [128, 1, False, 1, 64, 1, None]], #9  - 3
   [-1, 1, Bottleneck, [128, 1, False, 1, 64, 1, None]], #10 - 4
   [-1, 1, Bottleneck, [256, 2, True,  1, 64, 1, None]], #11 - 1
   [-1, 1, Bottleneck, [256, 1, False, 1, 64, 1, None]], #12 - 2
   [-1, 1, Bottleneck, [256, 1, False, 1, 64, 1, None]], #13 - 3
   [-1, 1, Bottleneck, [256, 1, False, 1, 64, 1, None]], #14 - 4
   [-1, 1, Bottleneck, [256, 1, False, 1, 64, 1, None]], #15 - 5
   [-1, 1, Bottleneck, [256, 1, False, 1, 64, 1, None]], #16 - 6
   [-1, 1, Bottleneck, [256, 1, False, 1, 64, 1, None]], #17 - 7
   [-1, 1, Bottleneck, [256, 1, False, 1, 64, 1, None]], #18 - 8
   [-1, 1, Bottleneck, [256, 1, False, 1, 64, 1, None]], #19 - 9
   [-1, 1, Bottleneck, [256, 1, False, 1, 64, 1, None]], #20 - 10
   [-1, 1, Bottleneck, [256, 1, False, 1, 64, 1, None]], #21 - 11
   [-1, 1, Bottleneck, [256, 1, False, 1, 64, 1, None]], #22 - 12
   [-1, 1, Bottleneck, [256, 1, False, 1, 64, 1, None]], #23 - 13
   [-1, 1, Bottleneck, [256, 1, False, 1, 64, 1, None]], #24 - 14
   [-1, 1, Bottleneck, [256, 1, False, 1, 64, 1, None]], #25 - 15
   [-1, 1, Bottleneck, [256, 1, False, 1, 64, 1, None]], #26 - 16
   [-1, 1, Bottleneck, [256, 1, False, 1, 64, 1, None]], #27 - 17
   [-1, 1, Bottleneck, [256, 1, False, 1, 64, 1, None]], #28 - 18
   [-1, 1, Bottleneck, [256, 1, False, 1, 64, 1, None]], #29 - 19
   [-1, 1, Bottleneck, [256, 1, False, 1, 64, 1, None]], #30 - 20
   [-1, 1, Bottleneck, [256, 1, False, 1, 64, 1, None]], #31 - 21
   [-1, 1, Bottleneck, [256, 1, False, 1, 64, 1, None]], #32 - 22
   [-1, 1, Bottleneck, [256, 1, False, 1, 64, 1, None]], #33 - 23
   [-1, 1, Bottleneck, [512, 2, True,  1, 64, 1, None]], #34 - 1
   [-1, 1, Bottleneck, [512, 1, False, 1, 64, 1, None]], #35 - 2
   [-1, 1, Bottleneck, [512, 1, False, 1, 64, 1, None]], #36 - 3
  ]

head:
  [[-1, 1, nn.AdaptiveAvgPool2d, [1]], #37
   [-1, 1, nn.Linear, [nc, True]], #38
  ]
