# BasicBlock_cifar, [5, 5, 5]
name: resnetc32
hyp: tiny
imgsz: 256
nc: 2 # NORMAL / PNEUMONIA

backbone:
  [[-1, 1, nn.Conv2d, [16, 3, 1, 1, 1, 1, False]], #0
   [-1, 1, nn.BatchNorm2d, [16]],
   [-1, 1, nn.ReLU, [True]],
   [-1, 1, cBasicBlock, [16, 1]], #3 - 1 : layer0
   [-1, 1, cBasicBlock, [16, 1]], #4 - 2 : layer0
   [-1, 1, cBasicBlock, [16, 1]], #5 - 3 : layer0
   [-1, 1, cBasicBlock, [16, 1]], #6 - 4 : layer0
   [-1, 1, cBasicBlock, [16, 1]], #7 - 5 : layer0
   [-1, 1, cBasicBlock, [32, 2]], #8 - 1 : layer1
   [-1, 1, cBasicBlock, [32, 1]], #9 - 2 : layer1
   [-1, 1, cBasicBlock, [32, 1]], #10- 3 : layer1
   [-1, 1, cBasicBlock, [32, 1]], #11- 4 : layer1
   [-1, 1, cBasicBlock, [32, 1]], #12- 5 : layer1
   [-1, 1, cBasicBlock, [64, 2]], #13- 1 : layer2
   [-1, 1, cBasicBlock, [64, 1]], #14- 2 : layer2
   [-1, 1, cBasicBlock, [64, 1]], #15- 3 : layer2
   [-1, 1, cBasicBlock, [64, 1]], #16- 4 : layer2
   [-1, 1, cBasicBlock, [64, 1]], #17- 5 : layer2
  ]

head:
  [[-1, 1, nn.AdaptiveAvgPool2d, [1]],  #18
   [-1, 1, nn.Flatten, []],             #19
   [-1, 1, nn.Linear, [nc, True]],      #20
  ]
