# BasicBlock_cifar, [9, 9, 9]
name: resnetc56
hyp: tiny
imgsz: 256
nc: 2 # NORMAL / PNEUMONIA

backbone:
  [[-1, 1, nn.Conv2d, [16, 3, 1, 1, 1, 1, False]], #0
   [-1, 1, nn.BatchNorm2d, [16]],
   [-1, 1, nn.ReLU, [True]],
   [-1, 1, cBasicBlock, [16, 1]], #3 - 1 : layer0
   [-1, 1, cBasicBlock, [16, 1]], #4 - 2 : layer0
   [-1, 1, cBasicBlock, [16, 1]], #5 - 3 : layer0
   [-1, 1, cBasicBlock, [16, 1]], #6 - 4 : layer0
   [-1, 1, cBasicBlock, [16, 1]], #7 - 5 : layer0
   [-1, 1, cBasicBlock, [16, 1]], #8 - 6 : layer0
   [-1, 1, cBasicBlock, [16, 1]], #9 - 7 : layer0
   [-1, 1, cBasicBlock, [16, 1]], #10- 8 : layer0
   [-1, 1, cBasicBlock, [16, 1]], #11- 9 : layer0
   [-1, 1, cBasicBlock, [32, 2]], #12- 1 : layer1
   [-1, 1, cBasicBlock, [32, 1]], #13- 2 : layer1
   [-1, 1, cBasicBlock, [32, 1]], #14- 3 : layer1
   [-1, 1, cBasicBlock, [32, 1]], #15- 4 : layer1
   [-1, 1, cBasicBlock, [32, 1]], #16- 5 : layer1
   [-1, 1, cBasicBlock, [32, 1]], #17- 6 : layer1
   [-1, 1, cBasicBlock, [32, 1]], #18- 7 : layer1
   [-1, 1, cBasicBlock, [32, 1]], #19- 8 : layer1
   [-1, 1, cBasicBlock, [32, 1]], #20- 9 : layer1
   [-1, 1, cBasicBlock, [64, 2]], #21- 1 : layer2
   [-1, 1, cBasicBlock, [64, 1]], #22- 2 : layer2
   [-1, 1, cBasicBlock, [64, 1]], #23- 3 : layer2
   [-1, 1, cBasicBlock, [64, 1]], #24- 4 : layer2
   [-1, 1, cBasicBlock, [64, 1]], #26- 5 : layer2
   [-1, 1, cBasicBlock, [64, 1]], #27- 6 : layer2
   [-1, 1, cBasicBlock, [64, 1]], #28- 7 : layer2
   [-1, 1, cBasicBlock, [64, 1]], #29- 8 : layer2
   [-1, 1, cBasicBlock, [64, 1]], #30- 9 : layer2
  ]

head:
  [[-1, 1, nn.AdaptiveAvgPool2d, [1]],  #31
   [-1, 1, nn.Flatten, []],             #32
   [-1, 1, nn.Linear, [nc, True]],      #33
  ]
