# Bottleneck, [3, 4, 6, 3]
name: resnet50
hyp: tiny
imgsz: 640
nc: 1000

backbone:
  [[-1, 1, nn.Conv2d, [64, 7, 2, 3, 1, 1, False]], #0
   [-1, 1, nn.BatchNorm2d, [64]],
   [-1, 1, nn.ReLU, [True]],
   [-1, 1, nn.MaxPool2d, [3, 2, 1, 1, False, False]],
   [-1, 1, Bottleneck, [64, 1, True,  1, 64, 1, None]], #4
   [-1, 1, Bottleneck, [64, 1, False, 1, 64, 1, None]], #5
   [-1, 1, Bottleneck, [64, 1, False, 1, 64, 1, None]], #6
   [-1, 1, Bottleneck, [128, 2, True,  1, 64, 1, None]], #7
   [-1, 1, Bottleneck, [128, 1, False, 1, 64, 1, None]], #8
   [-1, 1, Bottleneck, [128, 1, False, 1, 64, 1, None]], #9
   [-1, 1, Bottleneck, [128, 1, False, 1, 64, 1, None]], #10
   [-1, 1, Bottleneck, [256, 2, True,  1, 64, 1, None]], #11
   [-1, 1, Bottleneck, [256, 1, False, 1, 64, 1, None]], #12
   [-1, 1, Bottleneck, [256, 1, False, 1, 64, 1, None]], #13
   [-1, 1, Bottleneck, [256, 1, False, 1, 64, 1, None]], #14
   [-1, 1, Bottleneck, [256, 1, False, 1, 64, 1, None]], #15
   [-1, 1, Bottleneck, [256, 1, False, 1, 64, 1, None]], #16
   [-1, 1, Bottleneck, [512, 2, True,  1, 64, 1, None]], #17
   [-1, 1, Bottleneck, [512, 1, False, 1, 64, 1, None]], #18
   [-1, 1, Bottleneck, [512, 1, False, 1, 64, 1, None]], #19
  ]

head:
  [[-1, 1, nn.AdaptiveAvgPool2d, [1]], #20
   [-1, 1, nn.Linear, [nc, True]], #21
  ]
